package view;


import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

class MessageConstant {
    public static final List<String> messages = new ArrayList<>(Arrays.asList(
 //Сообщение первого знакомства, сдесь есть параметр КОД
            "Здравствуйте, Я - бот ЖСК \"Стальпроект-2\". Через меня, вы сможете подавать показания счётчиков. Я пока вас не знаю, но мы обязательно познакомимся.\n" +
            "Чтобы мы познакомились, большая просьба передать нашему Председателю следующую информацию (можете записать на бумажке, а можете показать ему это сообщение:\n" +
            "Код: %s \n" +
            "Так же, скажите Председателю, за какие квартиры вы хотите подавать данные.",
// Знакомство нужно начать заново. Есть кнопка "Старт"
            "Давайте начнём наше знакомство сначала. Когда будете готовы, нажмите кнопку \"Старт\"",
// Ожидание когда Предсведатель введёт код было слишком долгим
            "Я с нетерпением жду нашего знакомства, пожалуйста, передайте Председателю код:\n" +
            "%s \n" +
            "Либо напомните ему, что нужно этот код передать мне",
//Знакомство состоялось
            "Ну вот мы и знакомы. Вы сможете подавать данные за счётчики воды за квартиру:",
//Вопрос про напоминания
            "Хотите, я буду вам напоминать, когда пора передавать показания?",
//Подтверждение, что я буду присылать напоминание
            "Вы нажали \"Да\" - я буду вам присылать сюда напоминание \n",
//Напоминание, как изменить настройки. Есть параметр команда
            "Если вы захотите изменить настройки (любые настройки нашего с вами общения) - наберите команду %s"
            ));
}
